---
kind: type
id: T:Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData
source: html/11a35067-5428-3500-de8b-6319fa7f8c96.htm
---
# Autodesk.Revit.DB.Plumbing.PipePlumbingFixtureFlowData

The input and output data used by external servers for calculation of the pipe plumbing fixture flow.

## Syntax (C#)
```csharp
public class PipePlumbingFixtureFlowData : IDisposable
```

## Remarks
FlowConfiguration, FixtureUnits, FlowConversionMode, and DimensionFlow are input field values for the calculation. Flow is output field value for the calculation.